## Plan Result (sandbox-uksouth-enterprise)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_subscription.this
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Prod&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["CFT-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
        name                       = "CFT-Prod"
      ~ subscription_ids           = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "DTS-Terraform-Prod-Test1"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/322108"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "DTS-Terraform-Prod-Test1"
      + tenant_id         = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Target":"sandbox-uksouth-enterprise","Vars":{}} -->